In [14]:
import pandas as pd

In [15]:
df = pd.read_csv('01_03_empleados.csv', delimiter=";")

In [16]:
print(df.head(20))

       Nombre       Sexo   Estado_Civil  Edad  Experiencia  Salario Gerencia  \
0   Alexandro  Masculino     Soltero(a)  22.0          3.0   2423.0       No
1      Carlos  Masculino      Casado(a)  38.0         10.0   3132.0       Sí
2      Felipa   Femenino     Soltero(a)  26.0          5.0   2639.0       No
3      Daniel  Masculino      Casado(a)  35.0         10.0   3122.0       No
4        John  Masculino      Casado(a)  35.0         13.0   3431.0       Sí
5      Edward  Masculino     Soltero(a)   NaN          NaN   4500.0       No
6     Ruperta   Femenino      Casado(a)  54.0         18.0   3962.0       No
7       Amaya   Femenino  Divorciado(a)  22.0          3.0   2450.0      NaN
8   Francisca   Femenino     Soltero(a)  27.0          4.0   2564.0       No
9      Selena   Femenino      Casado(a)  24.0          6.0   2709.0       Sí
10       Febe   Femenino      Casado(a)  44.0         22.0   4359.0       No
11     Ximena   Femenino     Soltero(a)  58.0         24.0   4532.0       No
12      David  Masculino  Divorciado(a)  20.0          1.0   1977.0       No
13        Max  Masculino  Divorciado(a)  39.0          8.0   2953.0       No
14     Selena   Femenino      Casado(a)  24.0          6.0   2709.0       Sí
15        NaN   Femenino            NaN  44.0         22.0      NaN      NaN
16      Paula   Femenino  Divorciado(a)  55.0         12.0   3306.0       No
17        Tim  Masculino  Divorciado(a)  22.0          4.0   2518.0       No
18     Andrew  Masculino  Divorciado(a)   NaN         10.0   3194.0       No
19     Gloria   Femenino      Casado(a)  31.0         11.0   3267.0       No

            Departamento
0             Publicidad
1                    NaN
2              Comercial
3              Comercial
4   Servicios al cliente
5                  Legal
6               Producto
7              Comercial
8                     IT
9           Contabilidad
10                   NaN
11                 Legal
12      Recursos Humanos
13                Ventas
14          Contabilidad
15                   NaN
16              Producto
17      Recursos Humanos
18              Producto
19  Servicios al cliente

In [17]:
print(df.shape)

(251, 8)

- Desafío: Encontrar y eliminar las filas que contienen valores nulos dentro de nuestro dataframe

In [18]:
print(df.isnull().sum())

Nombre           6
Sexo            37
Estado_Civil     4
Edad            61
Experiencia      4
Salario          6
Gerencia        21
Departamento    12
dtype: int64

In [19]:
df = df.dropna(axis=0, how='any')
df

,Nombre,Sexo,Estado_Civil,Edad,Experiencia,Salario,Gerencia,Departamento
0,Alexandro,Masculino,Soltero(a),22.0,3.0,2423.0,No,Publicidad
2,Felipa,Femenino,Soltero(a),26.0,5.0,2639.0,No,Comercial
3,Daniel,Masculino,Casado(a),35.0,10.0,3122.0,No,Comercial
4,John,Masculino,Casado(a),35.0,13.0,3431.0,Sí,Servicios al cliente
6,Ruperta,Femenino,Casado(a),54.0,18.0,3962.0,No,Producto
...,...,...,...,...,...,...,...,...
244,Hernando,Masculino,Divorciado(a),29.0,4.0,2510.0,No,IT
245,Vito,Masculino,Divorciado(a),22.0,4.0,2530.0,No,Producto
246,Jose,Masculino,Casado(a),30.0,6.0,2760.0,No,Servicios al cliente
247,Marcelo,Masculino,Divorciado(a),44.0,15.0,3616.0,No,IT
250,Leandro,Masculino,Casado(a),37.0,11.0,3245.0,No,Finanzas

In [20]:
print(df.isnull().sum())

Nombre          0
Sexo            0
Estado_Civil    0
Edad            0
Experiencia     0
Salario         0
Gerencia        0
Departamento    0
dtype: int64